# Module 4 Project Task 2

## Task 1. Create DataFrame

In [42]:
import pandas as pd

grades_dic = {'Walley': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [93, 65, 84]}

grades = pd.DataFrame(grades_dic)

grades

   Walley  Eva  Sam  Katie  Bob
0      87  100   94    100   93
1      96   87   77     81   65
2      70   90   90     82   84

## Task 2. Custom Index

In [43]:
grades.index = ['Test1', 'Test2', 'Test3']
grades

       Walley  Eva  Sam  Katie  Bob
Test1      87  100   94    100   93
Test2      96   87   77     81   65
Test3      70   90   90     82   84

In [44]:
Eva = grades['Eva']
Eva

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [45]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## Task 3. Accessing Subsets (at, iat)

In [46]:
Eva = grades.at['Test2', 'Eva']
print(f"Eva's score on the second exam: {Eva}")

Eva's score on the second exam: 87

In [47]:
Walley = grades.iat[2,0]
print(f"Wally's score on the third exam: {Walley}")

Wally's score on the third exam: 70

## Task 4. Describe (By Column)

In [48]:
pd.set_option('display.precision', 2)
grades.describe()

       Walley     Eva    Sam   Katie    Bob
count    3.00    3.00   3.00    3.00   3.00
mean    84.33   92.33  87.00   87.67  80.67
std     13.20    6.81   8.89   10.69  14.29
min     70.00   87.00  77.00   81.00  65.00
25%     78.50   88.50  83.50   81.50  74.50
50%     87.00   90.00  90.00   82.00  84.00
75%     91.50   95.00  92.00   91.00  88.50
max     96.00  100.00  94.00  100.00  93.00

## Task 5. Transpose (rows <--> columns)

In [49]:
mean = grades.mean()
mean

Walley    84.33
Eva       92.33
Sam       87.00
Katie     87.67
Bob       80.67
dtype: float64

In [50]:
t = grades.T
t

        Test1  Test2  Test3
Walley     87     96     70
Eva       100     87     90
Sam        94     77     90
Katie     100     81     82
Bob        93     65     84

In [51]:
tmean = grades.T.describe()
tmean

        Test1  Test2  Test3
count    5.00   5.00    5.0
mean    94.80  81.20   83.2
std      5.45  11.54    8.2
min     87.00  65.00   70.0
25%     93.00  77.00   82.0
50%     94.00  81.00   84.0
75%    100.00  87.00   90.0
max    100.00  96.00   90.0